<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Основы-pandas" data-toc-modified-id="Основы-pandas-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Основы pandas</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Упражнение" data-toc-modified-id="Упражнение-1.0.1"><span class="toc-item-num">1.0.1&nbsp;&nbsp;</span>Упражнение</a></span></li><li><span><a href="#Основные-сведения-о-датафрейме" data-toc-modified-id="Основные-сведения-о-датафрейме-1.0.2"><span class="toc-item-num">1.0.2&nbsp;&nbsp;</span>Основные сведения о датафрейме</a></span></li><li><span><a href="#Отдельный-столбец-(тип-Series)" data-toc-modified-id="Отдельный-столбец-(тип-Series)-1.0.3"><span class="toc-item-num">1.0.3&nbsp;&nbsp;</span>Отдельный столбец (тип Series)</a></span></li><li><span><a href="#Упражнение" data-toc-modified-id="Упражнение-1.0.4"><span class="toc-item-num">1.0.4&nbsp;&nbsp;</span>Упражнение</a></span></li></ul></li><li><span><a href="#Атрибут-loc[строка,-столбец]-даёт-доступ-к-элементу-в-DataFrame-по-строке-и-столбцу" data-toc-modified-id="Атрибут-loc[строка,-столбец]-даёт-доступ-к-элементу-в-DataFrame-по-строке-и-столбцу-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Атрибут loc[строка, столбец] даёт доступ к элементу в DataFrame по строке и столбцу</a></span></li><li><span><a href="#Логическая-индексация-для-получения-элементов-по-определенному-условию" data-toc-modified-id="Логическая-индексация-для-получения-элементов-по-определенному-условию-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Логическая индексация для получения элементов по определенному условию</a></span></li><li><span><a href="#Индексация-в-Series" data-toc-modified-id="Индексация-в-Series-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Индексация в Series</a></span></li></ul></li><li><span><a href="#Фильтры" data-toc-modified-id="Фильтры-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Фильтры</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Отфильтруем-строки-с-потреблением-выше-среднего" data-toc-modified-id="Отфильтруем-строки-с-потреблением-выше-среднего-2.0.1"><span class="toc-item-num">2.0.1&nbsp;&nbsp;</span>Отфильтруем строки с потреблением выше среднего</a></span></li><li><span><a href="#Как-определить-используемый-вариант-названия-страны?" data-toc-modified-id="Как-определить-используемый-вариант-названия-страны?-2.0.2"><span class="toc-item-num">2.0.2&nbsp;&nbsp;</span>Как определить используемый вариант названия страны?</a></span></li></ul></li></ul></li><li><span><a href="#Сортировка" data-toc-modified-id="Сортировка-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Сортировка</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Параметр-inplace" data-toc-modified-id="Параметр-inplace-3.0.1"><span class="toc-item-num">3.0.1&nbsp;&nbsp;</span>Параметр inplace</a></span></li><li><span><a href="#Упражнение" data-toc-modified-id="Упражнение-3.0.2"><span class="toc-item-num">3.0.2&nbsp;&nbsp;</span>Упражнение</a></span></li></ul></li></ul></li></ul></div>

# Основы pandas

In [112]:
import pandas as pd

Пример забора данных с сайтов

In [ ]:
# pd.read_html('http://www.cbr.ru')[2]

In [113]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [114]:
df[0]

       Дата  Закрытие  Открытие  Максимум  Минимум
0  20.07.22    560000    564790    570000   544995
1  19.07.22    565000    577500    577500   550249
2  18.07.22    570000    569999    585055   562749
3  16.07.22    565000    565000    565000   565000
4  15.07.22    570000    581750    608310   565000
5  14.07.22    582750    584749    607630   580249
6  13.07.22    584750    584251    619380   582749
7  12.07.22    584250    590249    622500   582250
8  11.07.22    650000    665000    665000   592575

Импорт данных из файла

In [123]:
data = pd.read_csv('power.csv')
data.head(10)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1
5  Belgium  2011      25.0         1
6  Belgium  2010      22.0         1
7  Belgium  2009      45.0         1
8  Czechia  1998       1.0         1
9  Czechia  1995       7.0         1

In [116]:
data.tail()

          country  year  quantity  category
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [ ]:
type(data)

In [121]:
# если надо указать свои заголовки и разделитель
data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], header=0)
data.head()

    страна   год  количество  категория
0  Austria  1996         5.0          1
1  Austria  1995        17.0          1
2  Belgium  2014         0.0          1
3  Belgium  2013         0.0          1
4  Belgium  2012        35.0          1

In [ ]:
# количество строк в датафрейме

len(data)

In [118]:
# или так

data.shape

(1189482, 4)

Простые вычисления для нового столбца

In [ ]:
data['year_plus_one'] = data['year'] + 1
data.head()

In [ ]:
data.shape

In [ ]:
data.год

### Упражнение
Вам дана статистика продаж в файле transactions.csv. Вам необходимо загрузить этот файл в датафрейм и посчитать его размеры.

### Основные сведения о датафрейме

In [119]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   страна      1189482 non-null  object
 1   год         1189482 non-null  int64
 2   количество  1189482 non-null  float64
 3   категория   1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [120]:
# немного статистики

data.describe()

                год    количество     категория
count  1.189482e+06  1.189482e+06  1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01
std    7.167345e+00  1.585663e+07  1.809968e+01
min    1.990000e+03 -8.643480e+05  1.000000e+00
25%    1.997000e+03  1.400000e+01  2.400000e+01
50%    2.003000e+03  1.890000e+02  3.500000e+01
75%    2.009000e+03  2.265000e+03  5.100000e+01
max    2.014000e+03  6.680329e+09  7.100000e+01

### Отдельный столбец (тип Series)

In [ ]:
data['year'].head()

In [ ]:
# или так

data.year.head()

In [ ]:
type(data['year'])

In [ ]:
data.head()

In [ ]:
# уникальные значения в столбце

data['category'].unique()

In [ ]:
len(data['category'].unique())

In [ ]:
data['category'].tail(20)

In [ ]:
# распределение количества строк по значениям столбца

data['category'].value_counts()

In [ ]:
data['category'].value_counts(normalize=True).tail()

In [ ]:
data['year'].value_counts()

### Упражнение
Используем файл transactions.csv. Определите какой товар (столбец Product) упоминается в файле чаще всего?

In [ ]:
trans['Product'].value_counts()[1]

## Атрибут loc[строка, столбец] даёт доступ к элементу в DataFrame по строке и столбцу

df.loc[:, 'column']

In [124]:
data.loc[:,'country']

0           Austria
1           Austria
2           Belgium
3           Belgium
4           Belgium
             ...
1189477    Viet Nam
1189478    Viet Nam
1189479    Viet Nam
1189480    Viet Nam
1189481    Viet Nam
Name: country, Length: 1189482, dtype: object

In [125]:
data['country']

0           Austria
1           Austria
2           Belgium
3           Belgium
4           Belgium
             ...
1189477    Viet Nam
1189478    Viet Nam
1189479    Viet Nam
1189480    Viet Nam
1189481    Viet Nam
Name: country, Length: 1189482, dtype: object

Одна ячейка
.loc[7, 'column']

In [126]:
data.loc[7, 'country']

'Belgium'

Один столбец .loc[:, 'column']

Несколько столбцов .loc[:, ['column_1', 'column_4']]

In [ ]:
data.head()

In [127]:
data.loc[:, ['country', 'quantity']]

          country  quantity
0         Austria       5.0
1         Austria      17.0
2         Belgium       0.0
3         Belgium       0.0
4         Belgium      35.0
...           ...       ...
1189477  Viet Nam      92.0
1189478  Viet Nam      87.0
1189479  Viet Nam      50.0
1189480  Viet Nam      10.0
1189481  Viet Nam       1.0

[1189482 rows x 2 columns]

Несколько столбцов подряд (срез) .loc[:, 'column_5': 'column_8']

In [128]:
data.loc[2:100, 'country': 'quantity']

         country  year  quantity
2        Belgium  2014       0.0
3        Belgium  2013       0.0
4        Belgium  2012      35.0
5        Belgium  2011      25.0
6        Belgium  2010      22.0
..           ...   ...       ...
96   Netherlands  2004     186.0
97   Netherlands  2003     372.0
98   Netherlands  2002     234.0
99   Netherlands  2001     321.0
100  Netherlands  2000     276.0

[99 rows x 3 columns]

Одна строка .loc[1]

In [ ]:
data.loc[1]

Все строки, начиная с заданной .loc[1:]

In [ ]:
data.loc[1:]

Все строки до заданной .loc[:3]

In [ ]:
data.loc[:3]

Несколько строк подряд (срез) .loc[2:5]

In [ ]:
data.loc[2:5]

## Логическая индексация для получения элементов по определенному условию

Все строки,удовлетворяющие условию
'df.loc[df.loc[:,'column']== 'X']'
или сокращенно
'df[df['column'] == 'X']'

In [129]:
condition=data['year'] < 2000
condition

0           True
1           True
2          False
3          False
4          False
           ...
1189477    False
1189478    False
1189479    False
1189480    False
1189481    False
Name: year, Length: 1189482, dtype: bool

In [130]:
data[condition]

               country  year  quantity  category
0              Austria  1996       5.0         1
1              Austria  1995      17.0         1
8              Czechia  1998       1.0         1
9              Czechia  1995       7.0         1
21             Finland  1999       0.0         1
...                ...   ...       ...       ...
1189456  United States  1994    3483.0        71
1189457  United States  1993    3053.0        71
1189458  United States  1992    2917.0        71
1189459  United States  1991    3051.0        71
1189460  United States  1990    3066.0        71

[421050 rows x 4 columns]

In [131]:
data.loc[data.loc[:,'year'] < 2000]

               country  year  quantity  category
0              Austria  1996       5.0         1
1              Austria  1995      17.0         1
8              Czechia  1998       1.0         1
9              Czechia  1995       7.0         1
21             Finland  1999       0.0         1
...                ...   ...       ...       ...
1189456  United States  1994    3483.0        71
1189457  United States  1993    3053.0        71
1189458  United States  1992    2917.0        71
1189459  United States  1991    3051.0        71
1189460  United States  1990    3066.0        71

[421050 rows x 4 columns]

Столбец, удовлетворяющий условию
'df.loc[df.loc[:,'column']== 'X']['column']'
или сокращенно
'df[df['column'] == 'X'] ['column']'

In [ ]:
data.loc[data.loc[:,'year']==2000]['country']

In [ ]:
data[data['year'] == 2000]['country']

Применение метода
'df.loc[df.loc[:,'column']== 'X']['column'].count()'
или сокращенно
'df[df['column'] == 'X']['column'].count()'

In [ ]:
data.loc[data.loc[:,'country']=='Austria']['country'].count()

## Индексация в Series

Один элемент `df.loc[7]` `df[7]`

In [ ]:
df=data.quantity

In [ ]:
df.loc[7]

In [ ]:
df[7]

Несколько элементов `df.loc[[5, 7, 10]]` `df[[5, 7, 10]]`

In [ ]:
df.loc[[5, 7, 10]]

In [ ]:
df[[5, 7, 10]]

Несколько элементов подряд (срез) `df.loc[5:10]` включая 10 `df[5:10]` не включая 10

In [ ]:
df.loc[5:10]

In [ ]:
df[5:10]

Все элементы, начиная с заданного `df.loc[1:]` `df[1:]`

In [ ]:
df.loc[1:]

In [ ]:
df[1:]

Все элементы до заданного `df.loc[:3]` включая 3 `df[:3]` не включая 3

In [ ]:
df.loc[:3]

In [ ]:
df[:3]

In [ ]:
trans.tail()

# Фильтры

In [ ]:
data = pd.read_csv('power.csv')
data.head()

In [ ]:
# выбрать несколько столбцов

country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

In [ ]:
# или так

data[['country', 'quantity']].head()

In [ ]:
trans.loc[trans.loc[:,'Month'] == 12]['Month'].count()

### Отфильтруем строки с потреблением выше среднего

In [ ]:
average_level = data['quantity'].mean()
average_level

In [ ]:
'quantity > {}'.format(average_level)

In [ ]:
# строки с потреблением больше среднего

average_level = data['quantity'].mean()
country_stats.query('quantity > {}'.format(average_level)).tail(20)

In [ ]:
# самый популярный способ

data[ data.quantity > average_level ].head()

In [ ]:
data.head()

### Как определить используемый вариант названия страны?

In [132]:
data['country'].unique()

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France', 'Greece',
       'Hungary', 'Italy', 'Korea, Republic of', 'Netherlands', 'Romania',
       'Serbia', 'Slovakia', 'Ukraine', 'United Kingdom', 'United States',
       'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile', 'Croatia',
       'Iran (Islamic Rep. of)', 'Jordan', 'Lithuania', 'Mexico', 'Oman',
       'Other Asia', 'Poland', 'Portugal', 'Spain', 'Sweden',
       'Switzerland', 'T.F.Yug.Rep. Macedonia', 'Turkey', 'Uzbekistan',
       'Argentina', 'Colombia', 'Germany', 'Norway', 'Australia',
       'China, Macao SAR', 'Japan', 'Denmark', 'Ireland', 'Philippines',
       'Bangladesh', 'Eritrea', 'Ethiopia', 'Lesotho', 'Nepal', 'Niger',
       'Pakistan', 'Serbia and Montenegro', 'Tunisia', 'Botswana',
       'Georgia', 'Republic of Moldova', 'Peru', 'South Africa',
       'Iceland', 'Latvia', 'Luxembourg', 'Cuba', 'Kyrgyzstan',
       'Singapore', 'Thailand', 'United Arab Emirates', 'Uruguay',
       'Armenia', 'Fiji', "Korea, Dem.Ppl's.Rep.", 'Russian Federation',
       'Swaziland', 'Zimbabwe', 'Afghanistan', 'Antigua and Barbuda',
       'Azerbaijan', 'Bahamas', 'Belize', 'Bolivia (Plur. State of)',
       'Brazil', 'Burkina Faso', 'Cameroon', 'Cayman Islands',
       'Central African Rep.', 'China', 'Comoros', 'Congo', 'Costa Rica',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Estonia',
       'Ethiopia, incl. Eritrea', 'Faeroe Islands', 'French Guiana',
       'Germany, Fed. R. (former)', 'Greenland', 'Guatemala', 'Guinea',
       'Guyana', 'Honduras', 'Indonesia', 'Israel', 'Jamaica', 'Jersey',
       'Kazakhstan', 'Kenya', 'Kuwait', "Lao People's Dem. Rep.",
       'Liberia', 'Libya', 'Malawi', 'Malaysia', 'Maldives', 'Mauritania',
       'Mayotte', 'Morocco', 'Myanmar', 'Namibia', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niue', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Sao Tome and Principe', 'Senegal', 'Seychelles',
       'Slovenia', 'Solomon Islands', 'Sri Lanka', 'Sudan (former)',
       'Suriname', 'Togo', 'Tonga', 'Trinidad and Tobago',
       'United Rep. of Tanzania', 'Venezuela (Bolivar. Rep.)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria', 'Curaçao',
       'Gabon', 'Malta', 'Neth. Antilles (former)', 'Sierra Leone',
       'USSR (former)', 'Barbados', 'Benin', 'Chad', 'Djibouti',
       'French Polynesia', 'Ghana', 'Grenada', 'Guadeloupe', 'Haiti',
       'Iraq', 'Kiribati', 'Madagascar', 'Mali', 'Martinique',
       'Pacific Islands (former)', 'Palau', 'St. Helena and Depend.',
       'St. Vincent-Grenadines', 'Syrian Arab Republic', 'Uganda',
       'Yemen', 'Yemen, Dem. (former)', 'Burundi', 'India', 'Mauritius',
       'Mozambique', 'Nigeria', 'Réunion', 'Rwanda', 'Samoa', 'Somalia',
       'St. Kitts-Nevis', 'Viet Nam', 'Belarus', 'Cyprus', 'Cabo Verde',
       'Albania', 'Bahrain', 'Bosnia and Herzegovina',
       'China, Hong Kong SAR', 'Czechoslovakia (former)', 'Angola',
       'Bermuda', 'Bhutan', 'Equatorial Guinea', 'Lebanon',
       'Saudi Arabia', 'St. Lucia', 'St. Pierre-Miquelon',
       'State of Palestine', 'Tajikistan', 'German Dem. R. (former)',
       'Anguilla', 'Mongolia', 'Montenegro', 'Cambodia', 'South Sudan',
       'Sudan', 'Andorra', 'Aruba', 'Bonaire, St Eustatius, Saba',
       'British Virgin Islands', 'Dominica', 'Falkland Is. (Malvinas)',
       'Gambia', 'Gibraltar', 'Qatar', 'Sint Maarten (Dutch part)',
       'Turkmenistan', 'Turks and Caicos Islands', 'Vanuatu',
       'Guinea-Bissau', 'Micronesia (Fed. States of)', 'Timor-Leste',
       'Yemen Arab Rep. (former)', 'American Samoa', 'Liechtenstein',
       'Puerto Rico', 'Cook Islands', 'Guam', 'Guernsey', 'Isle of Man',
       'Marshall Islands', 'Montserrat', 'Nauru',
       'Northern Mariana Islands', 'Tuvalu', 'United States Virgin Is.',
       'Wallis and Futuna Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

In [133]:
# найдем как называется Россия и Беларусь в этом датафрейме
# фильтр на подстроку - смотрим все страны, содержащие в названии 'us'

data[ data['country'].str.contains('us', case=False) ]['country'].unique()

array(['Austria', 'Brunei Darussalam', 'Australia', 'Russian Federation',
       'USSR (former)', 'Mauritius', 'Belarus', 'Cyprus',
       'Bonaire, St Eustatius, Saba'], dtype=object)

In [136]:
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
filtered_countries = data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]

filtered_countries.tail(20)

                    country  year  quantity  category
1188209             Belarus  2000       0.0        71
1188210             Belarus  1999       0.0        71
1189176  Russian Federation  2014      96.0        71
1189177  Russian Federation  2013       5.0        71
1189178  Russian Federation  2012       5.0        71
1189179  Russian Federation  2011       5.0        71
1189180  Russian Federation  2010       4.0        71
1189181  Russian Federation  2009       4.0        71
1189182  Russian Federation  2008       5.0        71
1189183  Russian Federation  2007       7.0        71
1189184  Russian Federation  2006       5.0        71
1189185  Russian Federation  2005       7.0        71
1189186  Russian Federation  2004       7.0        71
1189187  Russian Federation  2003       9.0        71
1189188  Russian Federation  2002       6.0        71
1189189  Russian Federation  2001       3.0        71
1189190  Russian Federation  2000       2.0        71
1189191  Russian Federation  1999       2.0        71
1189192  Russian Federation  1998       0.0        71
1189193  Russian Federation  1997       0.0        71

In [ ]:
len(filtered_countries)

In [ ]:
filtered_countries['country'].unique()

In [ ]:
# фильтры на номер строки
data.loc[1000:1005]

Вывести страны начинаются на букву 'A' и в столбце 'quantity' показатель больше 20000

In [137]:
data[(data['country'].str.contains('A')) & (data['quantity']>20000)]

              country  year   quantity  category
80716       Australia  2014    21991.0        10
80717       Australia  2013    20946.0        10
80718       Australia  2012    21737.0        10
80719       Australia  2011    22449.0        10
80720       Australia  2010    20791.0        10
...               ...   ...        ...       ...
1177386  South Africa  2011   179200.0        69
1177977     Australia  2014  1174000.0        69
1177978     Australia  2011  1180100.0        69
1178021  South Africa  2014   175300.0        69
1178022  South Africa  2011   192900.0        69

[12743 rows x 4 columns]

# Сортировка

In [138]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [140]:
# Сортировка по столбцу

data.sort_values(by='quantity').head(10)

                   country  year  quantity  category
832375       United States  2000 -864348.0        42
832373       United States  2002 -562414.0        42
832362       United States  2013 -551490.0        42
832380       United States  1995 -493380.0        42
832322             Ukraine  2010 -477263.0        42
832199  Russian Federation  1997 -433511.0        42
831565              Canada  2000 -337266.0        42
831558              Canada  2007 -326275.0        42
831809           Indonesia  1999 -315000.0        42
831555              Canada  2010 -306558.0        42

In [141]:
# сортировка по убыванию

data.sort_values('quantity', ascending=False).head()

              country  year      quantity  category
492581  United States  2014  6.680329e+09        31
492267  United States  2014  6.680329e+09        31
492047          China  2014  5.462672e+09        31
492345          China  2014  5.462672e+09        31
122392  USSR (former)  1990  3.257000e+09        12

In [142]:
# сортировка по нескольким столбцам

data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False]).head(50)

             country  year      quantity  category
835127   Afghanistan  2014  1.935442e+06        42
491541   Afghanistan  2014  6.600000e+04        31
492004   Afghanistan  2014  6.600000e+04        31
492292   Afghanistan  2014  6.600000e+04        31
791301   Afghanistan  2014  5.537080e+03        42
797879   Afghanistan  2014  5.537080e+03        42
811493   Afghanistan  2014  5.537080e+03        42
813883   Afghanistan  2014  5.537080e+03        42
820564   Afghanistan  2014  5.537080e+03        42
828390   Afghanistan  2014  5.537080e+03        42
832393   Afghanistan  2014  5.537080e+03        42
1097271  Afghanistan  2014  4.486800e+03        67
1091772  Afghanistan  2014  3.767300e+03        67
1108326  Afghanistan  2014  3.710800e+03        67
1061021  Afghanistan  2014  2.967300e+03        67
1045322  Afghanistan  2014  2.204900e+03        67
364480   Afghanistan  2014  1.758409e+03        25
369505   Afghanistan  2014  1.758396e+03        25
518535   Afghanistan  2014  1.517400e+03        31
521820   Afghanistan  2014  1.517400e+03        31
496034   Afghanistan  2014  1.388700e+03        31
502008   Afghanistan  2014  1.388700e+03        31
509843   Afghanistan  2014  1.388700e+03        31
512335   Afghanistan  2014  1.388700e+03        31
1102803  Afghanistan  2014  1.049300e+03        67
334666   Afghanistan  2014  1.002966e+03        25
341782   Afghanistan  2014  1.002966e+03        25
353105   Afghanistan  2014  1.002966e+03        25
357841   Afghanistan  2014  1.002966e+03        25
563371   Afghanistan  2014  8.953000e+02        33
407563   Afghanistan  2014  8.821000e+02        27
419783   Afghanistan  2014  8.821000e+02        27
432306   Afghanistan  2014  8.821000e+02        27
437547   Afghanistan  2014  8.821000e+02        27
442787   Afghanistan  2014  8.821000e+02        27
462537   Afghanistan  2014  8.821000e+02        27
1053124  Afghanistan  2014  8.000000e+02        67
1066512  Afghanistan  2014  8.000000e+02        67
1116171  Afghanistan  2014  7.760000e+02        67
374415   Afghanistan  2014  7.554300e+02        25
378276   Afghanistan  2014  7.554300e+02        25
1137168  Afghanistan  2014  7.423000e+02        67
713410   Afghanistan  2014  7.130000e+02        39
719887   Afghanistan  2014  7.130000e+02        39
727865   Afghanistan  2014  7.130000e+02        39
733131   Afghanistan  2014  7.130000e+02        39
738397   Afghanistan  2014  7.130000e+02        39
753073   Afghanistan  2014  7.130000e+02        39
1161790  Afghanistan  2014  5.933000e+02        67
1111003  Afghanistan  2014  5.000000e+02        67

### Параметр inplace

In [ ]:
data.head()

In [ ]:
data.sort_values('country', ascending=True, inplace=True)

In [ ]:
data.head(20)

In [ ]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])

# чтобы сократить это выражение используем inplace:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

### Упражнение
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?

In [143]:
tr=pd.read_csv('transactions.csv')
tr.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [144]:
mx=tr[tr['Product']=='_8']['Cost'].max()
mx

2400

In [145]:
tr[(tr['Product']=='_8')&(tr['Cost']==mx)]['ID']

54    t055
Name: ID, dtype: object